{"podcast_details": {"podcast_title": "Baggage Unclaimed", "episode_title": "Disturbing Last Words Of Serial Killers", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/21460029/21460029-1666655413947-13b55c2e9dff7.jpg", "episode_transcript": " When serial killers are facing death's door, they can be remorseful, they can be profound, but more often than not, they leave words that haunt us even today. These are the last words of 25 serial killers. Number 1. Jeffrey Dahmer. In Wisconsin today, Jeffrey Dahmer died. He was murdered in the prison where he was sent in 1991 for murdering 17 men and boys. Jeffrey Dahmer was notoriously emotionless, and his last words were in keeping with his character. As you may know, Dahmer was faced with a sentence of 957 years, so prison was a place he was never going to come out of alive. But three years into his sentence, another inmate thought that his sentence wasn't punishment enough. In prison, Dahmer would be known for his grim sense of humor, and even put up a fake advertisement for cannibals anonymous, and told one of the guards, I bite. So, one day Dahmer was on cleaning duty with two other inmates. Seeing as he was now alone with Dahmer, fellow inmate Christopher Scarver grabbed a metal bar from the weight room and gave Jeffrey a taste of his own medicine. He killed him, and he killed him slowly. By the time the guards found him, he was basically unrecognizable. It was a level of justice that was probably deserved. Dahmer's entire demeanor throughout his trial was completely emotionless, and now facing death, his chilling final words were, I don't care if I live or die, go ahead and kill me. Number 2. Timothy McVeigh. A massive car bomb exploded outside of a large federal building in downtown Oklahoma City, shattering that building, killing children, killing federal employees, military men, and civilians. Another notorious killer in the 1990s was Timothy McVeigh. But unlike Dahmer's devious desires, McVeigh's crimes were politically motivated. Before September 11th, McVeigh's bomb in 1995 was the worst attack on US soil. His explanation? Revenge. US federal security had raided areas in Waco and Ruby Ridge, and took their weapons off religious and neo-Nazi groups. McVeigh saw this as an infliction upon their freedom, and was paranoid that the US government was trying to disarm the public. And he let the world know his views through a horrific bombing in Oklahoma City. Oklahoma carries the death sentence, and McVeigh knew he would one day be sitting in that electric chair. He showed little remorse, and believed that these killings were for the greater good. In an interview, he stated, Death penalty is what you would call an oxymoron. Death is not a penalty, it's an escape. They treat me like a trophy, like they got me. They're gonna kill me, and we won. They didn't win. In the crudest terms, 168 to 1. And before facing lethal injection, his last words were just as self-assured. In his final few moments, he said, I am the master of my fate. I am the captain of my soul. This is a line from William Ernest Henley's poem, Invictus. This verse was also read out a few years earlier, at the funeral of Ronnie Cray, a notorious British gangster. Number 3, Ted Bundy. This morning, just after sunrise, the man suspected of brutally killing 36 women, many of them in Utah, met the long, drawn-out demands of justice. If you're even vaguely aware of the evils of Ted Bundy, his last words might come as a bit of a shock. He confessed to 28 murders, with many people believing he was responsible for hundreds. Most of his victims, if not all, were women. Thankfully, he was caught before these numbers got any bigger. Inside the dark and depraved corners of Bundy's mind was an addiction to violent pornography. He was a cold-blooded psychopath, who failed to view women as anything other than objects of sexual desire. After decapitating their bodies, he would hold onto their heads as souvenirs. Upon being captured, he maintained his innocence for a long period of time. But when he was put on death row with nothing to lose, he finally confessed. So, after his last meal of some steak and eggs, he was invited to the electric chair. The press waited with bated breath to see what his last words would be. The tabloid press who wanted him to say something evil were left disappointed. It was an anticlimax. All he said is, I'd like you to give my love to my family and friends. That was Ted Bundy's last statement. His eyes looked like he was almost a child, and his mother caught him doing something wrong. I think if I asked a lot of our audience what their last words would be, it might be something similar. But these words coming from Ted Bundy give them a scary reminder that he's not so different from you or I. Number four, John Spenkerling. Capital punishment is a highly controversial form of justice, and lots of prisoners use the theater of sitting in the electric chair to critique this brutal punishment. John Spenkerling was one of these people. Spenkerling allegedly picked up a hitchhiker, and they ended up spending the night in a cheap motel. According to Spenkerling, the gun went off accidentally when they were fighting with each other. But that's not a story that the judge and jury would believe. He rather unluckily received capital punishment when it was reintroduced in Florida in 1976 and campaigned against it. I don't think if there'd just be a very few that don't. But I don't think there's anybody on death row now that does want to die. It was a controversial decision. Human rights groups were appalled, but many Floridians felt the other way, because Florida. On the day of Spenkerling's execution, a popular radio DJ in Jacksonville aired himself sizzling some bacon to celebrate. Again, Florida. So the state's killing machine was dusted off and plugged in again, and there was a sense of it was like starting an abandoned car up again, and it might not work or could conk out. Facing reporters before his death, he said, capital punishment. Then without the capital, get the punishment. And those of you who oppose the death penalty might agree with this statement. But maybe the messenger in this case does not help the cause. Number five, Robert Charles Comer. Robert Charles Comer was not the most eloquent of serial killers. While most of these killers see themselves as poets, this man was rather scarily normal about the situation. Comer was remarkably calm about his death sentence. In a competency hearing, he said, I don't know what everybody's so scared about. Death is not that damn bad. And in fact, he also showed some remorse for his actions. Although he fought his appeals against capital punishment, he eventually dropped them and said he owed it to his victims. It was time to face the music. So standing across from 20 witnesses, the warden asks him if he would like to have any last words. His response was, yes, go Raiders. In reference to his beloved NFL team, the Oakland Raiders. Number five, Peter Curtin. Peter Curtin was known as the vampire of Dusseldorf. And for good reason. He was convicted of nine counts of murder and seven counts of attempted murder. The vampire nickname came from the fact that he would often attempt to drink the blood of his victims. His crimes were committed in 1930s Germany when capital punishment was still part of its justice system. And by capital punishment, I don't mean sitting in an electric chair. This guy was given a French Revolution style ending on the guillotine. Facing up to his sick and twisted actions, Curtin's last words would give one last reminder of how disturbing this man truly was. Before the guillotine dropped, he said, tell me after my head has been chopped off, will I still be able to hear, at least for a moment, the sound of my own blood gushing from the stump of my neck? That would be a pleasure to end all pleasures. Number seven, Karl Panzram. Karl Panzram was charged with 21 murders, more than 1000 sexual assaults and another thousand or so robberies and arsons. Despite the size and scale of his crimes, he never left one single shred of remorse. When sentenced to death, he said, I look forward to a seat in the electric chair or dance at the end of a rope. Just like some folks do for their wedding night. He was genuinely angry with human rights activists who tried to get in the way of his execution. He was executed by hanging in 1930 and his last words involved him screaming at the executioner to get a move on. He said, hurry it up, you hoosier bastard. I could hang a dozen men while you're screwing around. Number eight, Eileen Wuornos. A lot of serial killers have a messiah complex. They think that through murdering people, they have godlike power to take life away. Eileen Wuornos was one such killer. In the space of a year, she killed seven men. She was a sex worker and argued that most of these killings were in self-defense. But then facing a death sentence, she came clean and said that she just killed them. Nonetheless, you killed seven men. Yes, you did. And I'm asking you what got you to kill the seven men. And I'm telling you because the cops let me keep killing them, Nick. Don't you get it? She was sentenced to death and was set to die via lethal injection. To her credit, she did apologize to the families of the victims. But her final words showed that she literally believed that she was the second coming of Christ. Her last words were, I'd just like to say I'm sailing with the rock and I'll be back like Independence Day. With Jesus, June 6th, like the movie. Big mothership and all. I'll be back. It won't surprise you to learn that she did not come back on June 6th. Number nine, Roger Keith Coleman. Roger Keith Coleman murdered his sister-in-law and was sentenced to the chair. The strongest argument against the death penalty is, what if the judge and jury got it wrong? The criminal justice system, after all, is far from perfect. And this is what Coleman said as he stood on the chair. His words were, an innocent man is going to be murdered tonight. When my innocence is proven, I hope Americans will realize the injustice of the death penalty, as all other civilized countries have. Mr. Coleman's last statement referred to about killing an innocent person. And he also stated that he loved his girlfriend, Sharon. Number ten, Thomas J. Grasso. Thomas J. Grasso's crimes were particularly cowardly. In 1995, he used Christmas tree lights to strangle a defenseless 85-year-old woman. Six months later, he strangled an 81-year-old man and stole his social security check. But Grasso is probably most famous for his last words. On your last day on death row, you have what will be your final meal. It can be almost anything you want. And most people go pretty extravagant and order steaks and lobsters. Grasso's last meal was a considerably long order. It consisted of 24 steamed mussels, 24 steamed clams, a Burger King double cheeseburger, six barbecued spare ribs, two large milkshakes, a tin of SpaghettiOs with meatballs, half a pumpkin pie, and strawberries and cream. But the chef got his order slightly wrong. The chef misunderstood that he wanted Spaghetti with meatballs, which I'm sure a lot of you will agree is a much nicer dish. But Grasso saw this as a great injustice and made this known before he left the earth. His last words were, I did not get my SpaghettiOs. I got spaghetti. I want the press to know this. Number eleven, Albert Fish. Albert Fish was one of the most notorious murderers of the early 20th century. He's believed to be the killer of at least 100 children. But the true extent of his evil is something we will never know. He was a sadomasochist. And before being put on the chair, he told the guards, it will be the supreme thrill. The only one I haven't tried. A witness during his execution noticed that Fish needed a few jolts to kill him before he died. And this was probably due to the number of needles Fish had inserted into his body. It took three minutes and several thousand volts to make sure that this guy was finally removed from this world. His last words were, I don't even know why I'm here. He was a classic psychopath who did not even comprehend right from wrong. Number twelve, John George Haig. John George Haig did not say much when sitting on the chair. His last recorded words were in a letter sent to his girlfriend. They read, it is difficult to say farewell under these circumstances. But you will understand that you will always be in my thoughts. You know I have been proud of our association. It has always been an honorable one. I shall remember your great kindness and devotion. Now I must leave you. And these kind words give us the impression that he's a fairly decent and honest fellow. The truth is that he killed and dissolved six women in acid. He was known as being quite a charmer and used to commit crimes of all kinds, including murder. But he will forever be known as the acid bath murderer. And from being far from charming in reality. Number thirteen, William Bonin. William Bonin was known as the freeway killer. In the space of a year he would kidnap, rob, murder and rape 14 teenage boys. He would find hitchhikers on the freeway. They would get into his van and he would bring them to their destination. Sentenced to death, his final meal was a feast fit for a king. He devoured two large pepperonian sausage pizzas, three pints of coffee ice cream and three packs of regular coca cola. Cholesterol levels don't really matter that much when you're about to face execution. His final words were ones of sorrow and regret. He said, I would suggest that when a person has a thought of doing anything serious against the law. That before they do that, they should go to a quiet place and think about it seriously. Number fourteen, Angel Maturino Resendiz. From the freeway killer to the railroad killer. Angel Maturino Resendiz was a drifter, riding the rails and would jump in and out of trains to cross the US. And during this tour of the good old US of A, he managed to kill 20 people, often near railroad tracks. When he was finally caught, he showed no remorse. I started just like a pig. Because these countries like the mother of all countries. And what happens in the US can change the entire world. So how do you want to change it? With death? With blood? Yes. This is the only way out. They want to see blood. And I give them blood. But Resendiz's final words would be a lot different. Facing death's door and soon meeting his maker, his sense of bargaining finally kicked in. With a handwritten letter to the world, his final words were. I want to ask if it's in your heart to forgive me. You don't have to. I know I allowed the devil to rule my life. I just ask you to forgive me and ask the Lord to forgive me for allowing the devil to deceive me. I thank God for having patience in me. I don't deserve to cause you pain. You do not deserve this. I deserve what I am getting. Number 15. Jem's French. Jem's French was given a life sentence for murdering a man who gave him a ride when he was hitchhiking. And then, behind bars, he managed to kill another inmate who called him stupid and refused to shape up. And a part of French wanted to be executed. He gave no plea to murdering the inmate and even wrote the court begging to die. French killed a man for calling him stupid and refusing to shape up. Suggesting that he took himself incredibly seriously. For his last words, he, rather uncharacteristically, decided to crack a joke. Normally, when facing the electric chair, the media come by to write reports of the event. And with all the newspapers, they would need a snappy headline to convey that Jem's French has been killed on the electric chair. So, French blurted out, Hey fellas, how about this for a headline for tomorrow's paper? French fries. It's too bad he stuck to crime instead of a career in stand-up comedy. Number 16. David Martin Long. David Martin Long was a man with quite a short fuse. His first murder was a gas station worker who he thought was ripping him off. The second was his boss and the third and fourth were two women he lived with who's constant complaining he couldn't stand. Sometimes, serial killers try to explain their actions. Often, it's an attempt to explain the unexplainable. But with so many serial killers in today's society, it's important to listen to what he says. He begins by saying, Ah, just sorry, y'all. I think I've tried everything I could to get in touch with y'all to express how sorry I am. I never was right after that incident happened. He goes on to say, I was raised by the California Youth Authority. I can't really pinpoint where it started, what happened, but I really believe that's just the bottom line. What happened to me was in California. I was in their reformatory schools and penitentiary. But ah, they create monsters in there. And then he closes his speech. That's it. I have nothing else to say. Thanks for coming, Jack. Number 17. H.H. Holmes. Convicted of 27 murders and possibly responsible for 200, H.H. Holmes was one of the US's worst ever killers. Like Dracula, he had a castle where he would lure his victims. He was also a famous swindler and con artist and was known as America's first serial killer. During his capture, he confessed, I was born with the devil in me. I could not help the fact that I was a murderer. No more than a poet can help the inspiration to sing. One of his strangest last requests was to have his coffin buried 10 feet deep and filled with cement, as he feared that his grave would be dug up. He loved adopting other personas and deceiving people. But on death row, everyone knew who he was and what he had done. The Grim Reaper was now calling him out. Once the executioner had everything set up, he said, Ready, Dr. Holmes? Holmes' response was, Yes, don't bungle. Apparently, the executioner eventually did bungle because his neck did not snap immediately. It was a slow and painful 15 minutes until he eventually met his maker. I also found it incredibly strange how the executioner still called him doctor when he had presumably lost his medical license after 27 confirmed murders. Number 18, Kimberly McCarthy. Kimberly McCarthy killed two elderly ladies and through her twisted logic, she believed that she was doing the Lord's work. Interestingly, she was the ex-wife of the now Black Panther Party founder, Aaron Michaels. But her addiction to drugs is possibly a bigger motivator for her behavior. Facing the electric chair, she expected to be given a high five by St. Peter or something when she reached the pearly gates. She said, This is not a loss, this is a win. You know where I am going. I am going home to be with Jesus. Keep the faith. I love y'all. Thank you, Chaplain. Number 19, Rosendo Rodriguez III. Rosendo Rodriguez also mentions the afterlife in his final words. He had killed two innocent women and his last words were, I have fought the good fight. I have run the good race, warden. I am ready to join my father. He was rather grimly known as the suitcase killer. Both of his victims were found in the exact same way. Inside a suitcase in a dumpster. One was a 16 year old girl. Another was a sex worker who was believed to be pregnant. The fact that he said he is ready to join his father adds an extra layer to this tale. His dad was a raging alcoholic and a domineering man. And the Rosendo suffered physical abuse from him. So when he mentioned the fact that he was going to see his father in the afterlife, he may have been referring to the place downstairs. Number 20, John Wayne Gacy. John Wayne Gacy is believed to have raped, murdered and tortured 33 people, many of which were young boys. Rather sadistically, he would visit children's hospitals dressed as a clown to get access. Rather than apologizing to the victims family, he would actually become abusive toward them. He apparently said, that one mother that gets on television all the time, who thinks I should get 33 injections. I think she ought to take 33 Valiums and go lie down. Appearing on death row, there was no remorse. And there were no grand proclamations. Having been known for his foul mouth and cruelty, he decided to go out in a familiar fashion. He left the earth with those famous three words, kiss my ass. Number 21, Israel Keys. Israel Keys was a serial killer, bank robber, arsonist, kidnapper and sex offender. He was quite unrepentant about his crimes. You're watching 34 year old Israel Keys describe over coffee and a bagel, his strategy for hunting and killing innocent people. Back when I was smart, I would let them come to me. Just remote area. Kind of go to a remote area that's not anywhere near where you live. But his final note is his criticism of other people's lives. Once put behind bars, Keys realized that life was no longer worth living and hanged himself in his jail cell. A note was left behind and Dr. Phil Resnick, director of forensic psychiatry at University Hospital's Case Medical Center in Cleveland, told ABC News.com, it's certainly not an ordinary suicide note. Addressing society, he said, You may have been free. You loved loving your lie. Fate had its own scheme. Crushed like a bug, you still die. Concluding his letter, he said, Okay, talk is over. Words are placid and weak. Back it with my actions or it all comes off cheap. Watch closely while I work now. Feel the electric shock of my touch. Open your trembling flower or your petals, I'll crush. Number 22, Jimmy Glass. Sarcasm is a tactic or trick often used by serial killers. The whole purpose of capital punishment is to make prisoners realize that gravity of what they have done. They would love to have reports of a terrified prisoner in fear as he waits for his death. Jimmy Glass murdered a husband and wife whose home he had burgled in. If that wasn't enough, he decided to conduct this robbery on Christmas Eve. He was sentenced to death and fought long and hard against the sentence. He claimed that his cellmate, Jimmy Wingo, whom he'd escaped from jail with, had forced them to carry out these murders. The court decided that Jimmy was for the birds. With a packed room waiting to see his last words, he simply uttered the phrase, I'd rather be fishing. Number 23, Tom Ketchum. Tom Ketchum also went under the alias of Black Jack and was a famous train robber from New Mexico. He was a cowboy and outlaw across the region and was suspected to be involved in the disappearance of Albert Jennings Fountain and his son, Henry Fountain. But despite these killings, it was actually his train robbing that resulted in his execution. His life was taken away from him because of felonious assault upon a railway train and was the first and only hanging in Union County, New Mexico. Ketchum fully embraced his outlaw reputation up until his final breath. Before being hanged, he shouted, I'll be in hell before you start breakfast, boys. Let her rip. Despite his desperation to get things going, his hanging was botched. The executioner used a rope that was too long and which left him decapitated. It took a few minutes until a doctor eventually pronounced him dead. So he was probably in hell by lunchtime. Number 24, Peter Manuel. Known as the Beast of Berkenshaw, Peter Manuel was Scotland's worst murderer. He was one of the first people to be known as a serial killer. He was convicted of killing seven people and he killed another person in England, which was considered another jurisdiction. Unluckily for Manuel, capital punishment was still enforced in this part of the UK until 1965. During his last days in jail, he refused to talk to the other wardens and would just quietly listen to the radio. He would receive visitations from his local priest and his mother. His mother, while in the presence of the priest, reportedly told him that she was enraged at this behavior and shouted, you can't fool me. But it looks as if he had just zoned out and was ready for his final day to arrive. When his day came, he had his hands tied and a hood placed over his head. Then the noose was fitted tightly around his neck. His last words were, turn up the radio and I'll go quietly. Number 25, Robert Alton Harris. Robert Alton Harris was charged with the kidnapping and murder of two teenage boys. It was a life of crime he chose and these charges meant that his life of crime was coming to an end pretty soon. For his last meal, he ordered quite a banquet. He had a 21 piece bucket of KFC, two large Domino's pizzas, a bag of jelly beans and a six pack of Pepsi. Back then in California, you were sent into the gas chamber and you would never come out. His last words were memorable. Inmate Harris's last statement was the following. You can be a king or a street sweeper, but everybody dances with a green reaper. His words before his death were probably the most profound on this list. However, it is believed to be a quote from the 1991 movie Bill and Ted's Bogus Journey. At the very least, it's better than go raiders. Thank you so much for watching. Please click on the videos you see in front of you now for more."}, "podcast_summary": "This podcast explores the chilling last words of 25 different serial killers. From the emotionless last words of Jeffrey Dahmer to the politically motivated Timothy McVeigh, each killer's final statement provides a glimpse into their character and mindset. Some show remorse, while others maintain their innocence, but overall these last words add an eerie and haunting perspective to their crimes. Whether it's the anticlimactic words of Ted Bundy or the dark desires expressed by Peter Curtin, these last words serve as a reminder of the unsettling nature of these individuals.", "podcast_guest": "Jeffrey Dahmer", "podcast_highlights": "Sure, here are the highlights from the podcast:\n\n1. Jeffrey Dahmer - \"I don't care if I live or die, go ahead and kill me.\"\n2. Timothy McVeigh - \"Death penalty is what you would call an oxymoron. Death is not a penalty, it's an escape.\"\n3. Ted Bundy - \"I'd like you to give my love to my family and friends.\"\n4. John Spenkerling - \"Capital punishment. Then without the capital, get the punishment.\"\n5. Robert Charles Comer - \"I don't know what everybody's so scared about. Death is not that damn bad.\"\n6. Peter Curtin - \"Tell me after my head has been chopped off, will I still be able to hear, at least for a moment, the sound of my own blood gushing from the stump of my neck?\"\n7. Karl Panzram - \"I look forward to a seat in the electric chair or dance at the end of a rope.\"\n8. Eileen Wuornos - \"I'll be back like Independence Day. With Jesus, June 6th, like the movie.\"\n9. Roger Keith Coleman - \"An innocent man is going to be murdered tonight.\"\n10. Thomas J. Grasso - \"I did not get my SpaghettiOs. I got spaghetti.\"\n11. Albert Fish - \"I don't even know why I'm here.\"\n12. John George Haig - \"Ready, Dr. Holmes? Yes, don't bungle.\"\n13. Kimberly McCarthy - \"This is not a loss, this is a win. You know where I am going. I am going home to be with Jesus.\"\n14. Rosendo Rodriguez III - \"I have fought the good fight. I have run the good race, warden. I am ready to join my father.\"\n15. Jem's French - \"Hey fellas, how about this for a headline for tomorrow's paper? French fries.\"\n16. David Martin Long - \"Okay, talk is over. Words are placid and weak. Back it with my actions or it all comes off cheap.\"\n17. H.H. Holmes - \"Kiss my ass.\"\n18. Israel Keys - \"You may have been free. You loved loving your lie. Fate had its own scheme. Crushed like a bug, you still die.\"\n19. Jimmy Glass - \"I'd rather be fishing.\"\n20. Tom Ketchum - \"I'll be in hell before you start breakfast, boys. Let her rip.\"\n21. Peter Manuel - \"Turn up the radio and I'll go quietly.\"\n22. John Wayne Gacy - \"Kiss my ass.\"\n23. Israel Keys - \"This is not a loss, this is a win. You know where I am going. I am going home to be with Jesus.\"\n24. Rosendo Rodriguez III - \"I have fought the good fight. I have run the good race, warden. I am ready to join my father.\"\n25. Robert Alton Harris - \"You can be a king or a street sweeper, but everybody dances with a green reaper.\""}