{"podcast_details": {"podcast_title": "Market MakeHer Podcast", "episode_title": "How To Invest In The Stock Market (step-by-step) | Market MakeHer Episode 12", "episode_image": "https://storage.buzzsprout.com/variants/mtj1u20kk0qns9irlb68fu6g3qxs/f6fd9b4ca4e468e7e11c8350463c894b252ee834d352e0a8d889b97ac83aedef.jpg", "episode_transcript": " You're listening to Market Make Her, the self-directed stock market education podcast that breaks down complex stock market topics in an easy to understand manner from her perspective. If you are new here, welcome. If you're not, welcome back. We're your host. I'm Jess Inskip, the resident finance expert. And I'm Jessi Danui, your guide on this financial empowerment journey, asking all the questions you were thinking. No rock left unturned, keeping Jess at a financial jargon land and away from Taylor's switch references, which is basically impossible. She did just release 1989, Taylor's version, and all that's left now is her name and reputation. Yes, case in point. In this time, we're going to highlight some listener questions upfront that we'll be answering in this episode, all about how to invest in the stock market, a step-by-step guide for beginners. Our first question is from listener, What We Should Have Learned, who asked, people say to get started, but how? The second question we're going to answer today is from Curly Lambie, who asked, what tips do you have if you're in your mid-40s for a small investment like $1,000 or less? And in case you're wondering, there's a reason we're discussing a beginner's guide on how to invest in the stock market now, episode 12, not on one of the earlier episodes or even back in episode one. The stock market and investing in general is completely overwhelming. We're ready to start and take that information that we learned and put it into action. That's what we're ready to do now, but we had to learn some things first. So super excited. If you've made it this far and you haven't opened up an investing account and you haven't started investing, now's your chance. Now's your time. I'm super excited about this episode. I think this is going to answer a lot of those beginner investing questions that we all have and we're just not sure how to even begin. Tell me step by step, what do I need to do to start investing right now? And that's what we're going to get into today. So Just, what's step one of investing in the stock market? So step one, and I love the analogy that we've thought up today, watched the Barbie movie finally and it was amazing. I loved it. Yeah, so good. I laughed, I cried. So many emotions. It's a roller coaster. All applicable. So great. So you are creating your Barbie dream house. This is it. But it made my goth Barbie dream house spray painted black. Yes, it would be, but we're all Barbie, which we've learned. That's right. Yes. But in order to create your dream house, because when we're investing, we're saving to have a better life. We want our money to make money so we can make more money so we can use that money to go do things. We don't have to work until we die. Exactly. The Barbie dream house doesn't mean literally a huge house. It's just your dream, your future that we're focusing on. In order to create that dream house, you have to have a solid foundation. And that solid foundation is consuming quality content. And that's essential for investing, understanding the stock market, understanding the intricacies, just like this podcast. And I don't think we need to go into the details because if you are lost up to here, go start at episode one. And send us your questions. You know, like real free to ask us if you're lost. Exactly. Clarification on. And here's why. When you have knowledge, you feel supported. Knowledge is literally power because you've done your research or you've done your homework. So you feel confident in the decisions that you are making. And that's why we wanted to make sure that you feel adequately supported and we are helping you lay that foundation. But the purpose of starting with financial literacy is you don't want to dive in and see something that's unexpected. Jesse said it so great so far. She'd point out words and be like, you know what? I actually saw that before. I look, I remember when you said that with market cap and you said, oh, I saw those words. I don't know what they actually mean. So now if you're going in and you're starting your investing journey, see all these words, you'll know what they mean. You feel more supported. And so you're going to make better decisions and you can confidently act because now you're going to have a solid foundation. And when you have a solid foundation, you become very resilient. Your structure of your home becomes resilient, but your financial journey, more importantly, is resilient. So that's step one. That's it. Short and simple. Congratulations. You all are already there if you've been listening. You have a good foundation. So then what is step two? Going on with this fun analogy. Location, right? Everything about real estate location has a lot to do with it. That's just choosing your brokerage firm. Already had an episode on that, episode nine. Brokerage firms, now that they have a zero commission and it's essentially cost nothing to place a trade, there's no minimums. You can just open up an account literally almost everywhere and it won't cost you a thing. And you can have multiple dream homes as well. So you can choose your multiple properties, but it depends on the features that are there. I'm going to link stockbrokers.com's guide. They have one that's for new investors. But if you really care about education, the best for education, the best for research, the best for retirement, the best for IRAs, just choose your brokerage firm. That's step number two. Once you laid your foundation, you want to make sure you have a good location. And you just need a few things to set up that, right? Like your social security number, your name, your address, the basic kind of banking information to set up an account. Yeah. And I think we talked about that on episode one too. It's those know your client rules. They are a thousand percent going to be invasive, but that is a requirement. It's a highly regulated industry. When you open up your brokerage account, there's also some admin and housekeeping that you need to do, like setting up beneficiaries. A will is not enough. That will still put you through probate, whole different episode. Okay. So we got some foundational knowledge. We've chosen a brokerage firm or multiple and we've set up some accounts. Do you need to just fund it first? Like put some money, whatever money you're ready to start investing with, whether it's $5, $50, $100 more, you need to deposit that into the brokerage account, right? Absolutely. So this is the framework. You're creating structure. Here's where we're going to get into a lot of details. I feel like we just did a lot of review. Let's talk about going forward. Successful investing is all about consistency and discipline. Invest early and often. That's going to be a market maker saying right there. Invest early and often. I will say it again. Whether you're starting out and you're younger in your journey or you're even older, you want to stay disciplined and stick to that structure. And there's a couple of ways that you can easily do that. First and foremost is automatic deposits. So there's a rule of thumb. We don't talk about budgeting on this podcast. Perhaps we'd have an episode, but the rule of thumb is you need to invest at least 30%. Now that's a goal and it's also a minimum, totally acknowledging that that is not feasible at all times. I've been in points in my investment journey. I used to clean hotel rooms before I was in finance when I was 18 years old. Definitely has started my journey from a place where I didn't have a lot of money and was able to save and work my way up. And so I understand that not being feasible. But what you can do and when you can is even if it's just $5 a paycheck, you work your way up. So you want to aim to at least automatically put into this account 30% of whatever you're bringing in your overall income. Is that all accounts together? So like whether it's retirement or a separate non-retirement brokerage account? Yeah, that's the investing that you want to save is always 30% of your income. That's a minimum though. If you can swing 50%, that's even better. But you also need to take into account your lifestyle. Just roll with facts limits, right? If it's your IRA, then there's those yearly limits. But then for a regular brokerage account, that's non-retirement. There really isn't a limit, is there? No, there's not. You can put in whatever you want. Okay, cool. You have those automatic deposits. That also changes. Anytime you get a raise, anytime you get a bonus, anytime you have an influx of money, you want to increase those deposits. And this is something that I learned the hard way. I started experiencing lifestyle creep. I got into finance, still had a lower paying job. My first job, I think I made $38,000. But 15 years ago, that's not too bad, I suppose. But I started doubling my income and then getting higher and higher. And that can very easily create lifestyle creep. You get a bigger house or you pay more rent, things like that. And if that happens to you, you need to pay yourself first. And the way that you pay yourself first is by increasing your automatic deposits. So you invest first before you even realize a higher paycheck. Literally I hide money for myself. That's the way that I have successful investing. Me too. I even like savings accounts. I'm like, that doesn't exist. If it's something in a high yield savings account that needs to be more liquid for something more... Exactly.... sooner than later, yeah. You got to pretend that it's not there until you actually really need it for whatever the goal was. Exactly. Separate your funds. Literally, it's points of desperation where we're going to touch this account. It's your extreme last resort because time, like you said, Jessi, is so much more important than the amount invested. And when you withdraw, you stop time and we don't want to do that. The only time, time's going to really work in your favor. Yeah. Yeah, that's a good way to look at it. Time's not always a bad thing. Yeah. So now that you've set up your automatic investments, you know how much you're going to put in, literally you link up your bank account on your brokerage firm. You can even do it by account. So I have automatic investments that go into a savings account. Then I have another amount that goes into a brokerage account monthly. And then another that goes to my son's account actually every time I get a paycheck. That's the way I disperse personally my funds that I don't see, that I just pretend do not exist. Smart. Just got to hide it. You know, I really love shopping. So... But step four is really important. It's getting into the right mindset. And I don't think we've talked about the volatility index or the VIX index yet. No, I've never heard of that. So it's called the fear gauge. Volatility just means uncertainty. And if there is uncertainty, things move a lot quicker, up or down. And that's called the fear index. It's a bad reputation because you need volatility. You need it to make money. Yeah, that's kind of what helps make you... Exactly. Exactly. So, volatility is just like going on a roller coaster. When you go on a roller coaster, there's height requirements depending on how, I guess, vigorous or intense the ride is going to be. But you're fully aware of that. Maybe you've seen a video on that ride or you've looked at... People have told you about their past performance on that ride. So you go on that ride with the full expectation that you might be scared. But you're strapped in and you can't get out if you go all the way up to the first drop. And most of the time, at least I am, I love roller coasters, you're happy you made it all the way through because you're in it for the overall experience. You want a good experience. That's the stock market. There is absolutely going to be ups and downs. If you don't exit out on that first drop, you're going to have an awesome experience. Oh, yeah. That makes a lot of sense. It totally is like a roller coaster. If you even look at the historical data, the overall timeline of the stock market and how it's performed over the last several decades, and it does go up and down just like roller coaster. We've talked about emotional investors, how when things go down, if you freak out and pull all of your money out, you're going to miss that next upswing when it comes back up again. So just take into account the length of time you're willing to be invested. It's usually something that we're leaving in for several decades, at least. It might be a good time, though, to address the question we had. If you are someone that's getting a later start, like mid 40s, mid 30s, whatever, we know length of time is important, but make sure you have a diversified portfolio, right? And make sure you have some maybe in those things that we've talked about that are more stable, not as crazy of a roller coaster, like maybe a little bit easier of a ride. You definitely want to protect it a little more if you're starting later out, but to start now, we're talking about growing your investments, even in your retirement accounts. We still need to do an episode on retirement planning. We want to do an episode on what's your number and start early, start often. I feel like we've all seen this floating around TikTok or Reels or wherever you consume your short form video content. The one of Judge Judy, where she's like, you don't start your dream at 30. Well, keep going. You're at 40. Like it's never too late to start. Yeah. Same with investing. It's not too late. Yeah. Start today. Before you know it, time goes by. I have a 12 year old now. How'd that happen? I know. I don't know. I don't know. Me neither. Now this brings us to step number five, which is where we bring our dream home to life. And this is where we're going to talk about compound interest. How your money makes money and then makes more money. Yeah. Make that money, make money. I actually have a tool for this. Ooh, a tool. This is a compound interest calculator. We have zero to invest initially. We're starting completely from scratch. Our contributions, I want to be modest and maybe say just a hundred dollars a month. I know we see the average return of the stock market is 7%. I like to use 10%. That's an antiquated number, the 7%. If you look at the annualized rate of the stock market, it's actually around 12 to 13% for the past 10 years. Wow. We can still look on the lower end and say 10. Yeah. So. So our total contributions though are going to be $12,000 over 10 years. $12,000 will turn into $20,484. Wow. Purely from the beauty of compound interest. Just sitting there and making those automatic contributions of a hundred dollars a month, we'll call that $50 a paycheck. Double that to 20 years. Now you have 75,000. This is how your money makes money. So we did 50 a paycheck over 20 years that gave us $75,937. Total contributions $24,000 interest earned over that 20 year period is 51,000. Wow. That's way better than a savings account. That it is. A high yield one. And time is absolutely more important than the amount that's invested. You continuously contribute when you're making a contribution, you're reinvesting. Anytime there's cash, it's just automatically invested. We're assuming a rate of return of 10%. It's like going to the gym or doing yoga. You got to like get yourself on the mat. Once you're there, you're like, you'll do your workout. You'll do your yoga class. Getting there, getting yourself to that point sometimes is the hardest thing. Okay. We should talk about the next step, choosing the investments. Cause I think that's also part of the fear. A lot of people don't know literally what to choose. So choosing your investments. Diversification is super key. That's why all these financial gurus say index ETFs. Investments that are popular solutions because they literally just mirror the S&P 500. We talked in so much detail in episode four on how funds and mutual funds work. And we also know how we can find ETFs that mirror the S&P 500 with tools at the brokerage firm you have chosen like a screener or investment ideas. Choosing your investment options. You want to make sure that you have diversification. Mutual funds are a way to do that. So are exchange traded funds. And if you want to know the differences, check out episode four. That's why again, we had to cover all these foundations because now you get to step six and you'd be like, Oh wait, what is that? And then we've got to go back. If you want to generate some alpha is what it's called. You want to beat the market. You can add a couple of stocks and you don't have to choose one. Like you can do a combination of all of this. These ETFs cost a lot less than like buying a bunch of individual stocks and it's spreading your money out across a bunch of companies instead of just picking individual stock. You are investing in stocks still. Like you're still doing something that you're hoping to have a good return. That's proven over time to continue to kind of go up. Even if it comes down, it comes back up again. If you want to buy some direct Apple stock, you could, right? Yeah. I mean, we've really scratched the surface on that and we're going to evaluate stocks and understand it hits a goodbye or not. Cause if you want to add that to your portfolio, I personally invest in stocks. There's different between trading and investing, but absolutely the key is quality, which is something we can determine. Every investment guru is going to tell you what we just said about compound interest. What they're not going to tell you is the market cap weighting and how to understand that and picking quality investments. The reason why you say a passive ETF or fund or index fund passive means it's mirrors and indices or index is because it's a portfolio manager that's already has the methodology. The S&P 500 is made up right now of 503 stocks. Things go in and out of that as we established when we talked about understanding the stock market because it's like an elite club. If they don't meet those club requirements, they're kicked out. You have somebody assessing the quality for you constantly. If you want to learn how to assess that quality yourself or determine a stock that you think has potential growth opportunity, that's okay too. We're not talking penny stocks, things like that. We're talking about long-term investments to help you grow your wealth. So once you set up your brokerage account, you funded it with some money, whatever you can start with. You should be able to pick an index ETF or fund that mirrors one of the major indexes, indices with a minimal amount of money to get started. And then you can go from there as you learn on this podcast, other things you might want to invest in as we help you continue to learn how to do this kind of research to make smart investment decisions. That's right. The second you do that, you stepped on the roller coaster. Now we're going to be ups and downs. Buckled in. That brings us to step number seven. We're kind of scratching the surface here. We're going to get into a little more details and asset allocation. So diversification can be done through a index fund or a mutual fund like we're talking about. Then there's sector weightings and things like that. So if you come up with and say, I have a percent of my account that I just want to have in these passive index ETFs. And then another that I want to have in a stock or you have your investment thesis and whatever that may be, or you're focusing on a specific sector because you really believe in AI's, you've got all that there. Once a quarter, you need to reassess everything in your life. Where are you on the income coming in? Is there more? Do you need to readjust those automatic investments? Because that's really important to prevent lifestyle creep. You need to check your allocation and your investment thesis. You need to give yourself this pulse check of what you need to adjust to make sure that you're on track to that goal, whatever that may be. And this might be an account for you to save up for a new house, or this might be the account for your retirement, or just by the account that you're just growing money in general. Either way, you need to make sure that nothing has changed for you that would affect you getting that dream Barbie house. Keep calling it Barbie house. Yeah. Whatever your dream goal is. And if you have a financial advisor, that's exactly what they're going to do with you. And there are tools for that. They're called like, there's another story on Merrill that's called Portfolio Story, where you would literally do the same thing. Checking your account quarterly. So, so important because things change in your life. And I think like a calendar reminder alert for that. Yeah. Do you set a calendar reminder alert to check quarterly or what? How do you do it? No, I work in the stock market, so I check. True. Almost every day. How do you resist the urge, because you are looking at all this information every day, how do you resist the urge to do anything? This is something that happens to you when you work in finance is you get desensitized from money, which sounds so terrible. No, it's the same with advertising actually, because it's like I'm, I don't think of that as okay, I, any clients that are listening or anyone that does have like someone doing your Google ads or social media advertising. Of course we know it's your money, but you kind of have to stop thinking of it as money at some point because you want to make the right optimizations to make sure that you're going to get the best ROI. And I feel like it probably applies to this too. Like you got to kind of at some point let go of the fact that that's your hard-earned money that you spend an X amount of hours making so that you can put on the like analysis cap or the logical cap of like, okay, I just need to go ahead and put that much money into this index fund or whatever it is, because I know over time with compound interest, it's going to give me X back. This brings us to step number eight. Keep learning, keep earning. The financial world evolves, and I think that's so important to know. And it evolves over decades. Technology evolves as well. Interest rates change. So I know how you'll savings accounts are great right now. I love that I can have a high yield savings account at 5%. I never thought I'd have to say that. I know, I never thought that would happen. But it's not going to last. We know it's not going to last. So make sure you're thinking ahead. That's right. Because the Fed is going to start cutting interest rates at some point. So the market implies as early as November, 100% chance by next year due to probabilities, another episode we can talk about to look at that, meaning that has an effect on your high yield savings accounts. Those are great. They are temporary. I hate saying that. They're temporary, guys. I'm glad I have some money in there for now while I've been learning all this because yeah, I have been wanting to make sure I learned a little bit more before I started trying to do any kind of growth investing for myself. Yeah, and you don't have to put your big chunk in there. But you could start doing compound interest and do $50, $100 a month, whatever you can put in that you're just like, I'm okay not seeing this money for a couple decades. Yeah, I need to get started now. You're right. But we're ready now. I really think that, no, you're a perfect example because we literally went through 12 episodes. I'm definitely this way in everything I do. We have to have a solid foundation. We have to understand it because those solid foundations just builds confidence. It's how you feel supported and being able to execute upon that strategy. And I think now you'll go in and be like, okay, yeah, I know how this works. And I know that this may go down quite a bit, but I know that I just need to keep buying more and dollar cost averaging and everything will be a-okay. Yeah, get over that fear, learning about it, knowledge, listening to our podcast, asking questions. We're here for you. I had conversations for years about how the stock market works because she had so many questions, but because I was financially licensed at the time, couldn't do something like this. And then finally, when I gave up my financial licenses, we kept having these conversations. I'm so glad Jesse gave me the courage to do something like this. My return to Jesse is giving her the courage to start investing. And hopefully that's the courage to everyone else. This just, it's not intentionally gate kept from you. Here it is. Right. Yeah, go forth and invest. Sometimes it is a little gate kept for you because people want your money, but we're not doing that to you. We're giving it to you for free. So that's true. This is a whole course. Basically, like the first 12 episodes is a free course in investing for all of you because we want everyone to be able to retire and make their money, make money and not have to work until they're like 90 or however long we end up living. Very true. Which also brings a great point as we come to our closes, we have not monetized this podcast yet. In fact, it does cost us money at this point, which is okay. But to help us with that mission and spreading the word, if you just leave a review on Apple podcast or Spotify, share this, that really does volumes for our numbers. And we would just so appreciate that. Help us help you by giving us a review. Look at that. I like it. Also, you may have noticed that we're behind in our episode equity. My apologies. This is also our five to nine after nine to five. But graphics are updated for this episode because it's so important as well as a full checklist. So make sure you check it out. The entire detailed guide on market make her podcast.com. And remember that's market make her h e r podcasts.com. Yeah, the episode equity it's already published. It is your step by step guide. Do not delay to start with whatever you can $5 $10 $50 whatever you have is your sign to go ahead and get started. And if you're listening on Spotify, don't forget to participate in our poll and answer our question. We do one every week. Help us bridge the financial gap. And until next time, keep building knowledge and keep breaking those barriers. Remember investing involves risk. There is always potential to lose money when investing in securities. Market make her provides educational content and resources for informational purposes only. We are not registered financial advisors. For more information, visit market make her podcast.com."}, "podcast_summary": "Market Make Her is a podcast that aims to break down complex stock market topics in an easy-to-understand manner. In this episode, the hosts discuss a step-by-step guide for beginners on how to invest in the stock market. They address listener questions and provide valuable advice on creating a solid foundation, choosing a brokerage firm, funding your account, and developing the right mindset for investing. The hosts emphasize the importance of diversification, automatic deposits, and regular portfolio assessments. They also highlight the power of compound interest and the need to keep learning as the financial world evolves. Overall, this episode provides valuable insights and guidance for anyone looking to start their investing journey.", "podcast_guest": "Jess Inskip", "podcast_highlights": "- Step 1: \"In order to create your dream house, you have to have a solid foundation. And that solid foundation is consuming quality content.\"\n- Step 2: \"Choosing your brokerage firm. Now that they have a zero commission and it's essentially cost nothing to place a trade, there's no minimums.\"\n- Step 3: \"Funding your brokerage account. You need to deposit money into the account to start investing.\"\n- Step 4: \"Setting up automatic deposits. Invest early and often.\"\n- Step 5: \"Getting into the right mindset. Understand the volatility index and embrace the ups and downs of the stock market.\"\n- Step 6: \"Choosing your investments. Focus on diversification and consider index ETFs or mutual funds.\"\n- Step 7: \"Reassessing your portfolio. Check your allocation and investment thesis quarterly.\"\n- Step 8: \"Continuing to learn and grow. Stay informed about the financial world and keep earning.\"\n"}